Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/emafe.h
/* -------- EMAFE_SR : (EMAFE Offset: 0x60) ( R/ 32) Status Register -------- */
#define EMAFE_SR_CHAEVT_Pos                   _UINT32_(0)                                          /* (EMAFE_SR) Event on Channel A Position */
#define EMAFE_SR_CHAEVT_Msk                   (_UINT32_(0x1) << EMAFE_SR_CHAEVT_Pos)               /* (EMAFE_SR) Event on Channel A Mask */
#define EMAFE_SR_CHAEVT(value)                (EMAFE_SR_CHAEVT_Msk & (_UINT32_(value) << EMAFE_SR_CHAEVT_Pos)) /* Assigment of value for CHAEVT in the EMAFE_SR register */
#define EMAFE_SR_CHBEVT_Pos                   _UINT32_(1)                                          /* (EMAFE_SR) Event on Channel B Position */
#define EMAFE_SR_CHBEVT_Msk                   (_UINT32_(0x1) << EMAFE_SR_CHBEVT_Pos)               /* (EMAFE_SR) Event on Channel B Mask */
#define EMAFE_SR_CHBEVT(value)                (EMAFE_SR_CHBEVT_Msk & (_UINT32_(value) << EMAFE_SR_CHBEVT_Pos)) /* Assigment of value for CHBEVT in the EMAFE_SR register */
#define EMAFE_SR_Msk                          _UINT32_(0x00000003)                                 /* (EMAFE_SR) Register Mask  */


/* -------- EMAFE_WPMR : (EMAFE Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define EMAFE_WPMR_WPCFEN_Pos                 _UINT32_(0)                                          /* (EMAFE_WPMR) Write Protection Configuration Enable Position */
#define EMAFE_WPMR_WPCFEN_Msk                 (_UINT32_(0x1) << EMAFE_WPMR_WPCFEN_Pos)             /* (EMAFE_WPMR) Write Protection Configuration Enable Mask */
#define EMAFE_WPMR_WPCFEN(value)              (EMAFE_WPMR_WPCFEN_Msk & (_UINT32_(value) << EMAFE_WPMR_WPCFEN_Pos)) /* Assigment of value for WPCFEN in the EMAFE_WPMR register */
#define EMAFE_WPMR_WPITEN_Pos                 _UINT32_(1)                                          /* (EMAFE_WPMR) Write Protection Interrupt Enable Position */
#define EMAFE_WPMR_WPITEN_Msk                 (_UINT32_(0x1) << EMAFE_WPMR_WPITEN_Pos)             /* (EMAFE_WPMR) Write Protection Interrupt Enable Mask */
#define EMAFE_WPMR_WPITEN(value)              (EMAFE_WPMR_WPITEN_Msk & (_UINT32_(value) << EMAFE_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the EMAFE_WPMR register */
#define EMAFE_WPMR_WPCTRL_Pos                 _UINT32_(2)                                          /* (EMAFE_WPMR) Write Protection Control Position */
#define EMAFE_WPMR_WPCTRL_Msk                 (_UINT32_(0x1) << EMAFE_WPMR_WPCTRL_Pos)             /* (EMAFE_WPMR) Write Protection Control Mask */
#define EMAFE_WPMR_WPCTRL(value)              (EMAFE_WPMR_WPCTRL_Msk & (_UINT32_(value) << EMAFE_WPMR_WPCTRL_Pos)) /* Assigment of value for WPCTRL in the EMAFE_WPMR register */
#define EMAFE_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (EMAFE_WPMR) Write Protection Key Position */
#define EMAFE_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << EMAFE_WPMR_WPKEY_Pos)         /* (EMAFE_WPMR) Write Protection Key Mask */
#define EMAFE_WPMR_WPKEY(value)               (EMAFE_WPMR_WPKEY_Msk & (_UINT32_(value) << EMAFE_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the EMAFE_WPMR register */
#define   EMAFE_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x768070)                                   /* (EMAFE_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0.  */
#define EMAFE_WPMR_WPKEY_PASSWD               (EMAFE_WPMR_WPKEY_PASSWD_Val << EMAFE_WPMR_WPKEY_Pos) /* (EMAFE_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0. Position  */
#define EMAFE_WPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (EMAFE_WPMR) Register Mask  */


/* -------- EMAFE_WPSR : (EMAFE Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define EMAFE_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (EMAFE_WPSR) Write Protection Violation Status Position */
#define EMAFE_WPSR_WPVS_Msk                   (_UINT32_(0x1) << EMAFE_WPSR_WPVS_Pos)               /* (EMAFE_WPSR) Write Protection Violation Status Mask */
#define EMAFE_WPSR_WPVS(value)                (EMAFE_WPSR_WPVS_Msk & (_UINT32_(value) << EMAFE_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the EMAFE_WPSR register */
#define EMAFE_WPSR_WPVSRC_Pos                 _UINT32_(8)                                          /* (EMAFE_WPSR) Write Protection Violation Source Position */
#define EMAFE_WPSR_WPVSRC_Msk                 (_UINT32_(0xFFFF) << EMAFE_WPSR_WPVSRC_Pos)          /* (EMAFE_WPSR) Write Protection Violation Source Mask */
#define EMAFE_WPSR_WPVSRC(value)              (EMAFE_WPSR_WPVSRC_Msk & (_UINT32_(value) << EMAFE_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the EMAFE_WPSR register */
#define EMAFE_WPSR_Msk                        _UINT32_(0x00FFFF01)                                 /* (EMAFE_WPSR) Register Mask  */


/* -------- EMAFE_VERSION : (EMAFE Offset: 0xFC) ( R/ 32) Version Register -------- */
#define EMAFE_VERSION_VERSION_Pos             _UINT32_(0)                                          /* (EMAFE_VERSION) Version of the Hardware Module Position */
#define EMAFE_VERSION_VERSION_Msk             (_UINT32_(0xFFFF) << EMAFE_VERSION_VERSION_Pos)      /* (EMAFE_VERSION) Version of the Hardware Module Mask */
#define EMAFE_VERSION_VERSION(value)          (EMAFE_VERSION_VERSION_Msk & (_UINT32_(value) << EMAFE_VERSION_VERSION_Pos)) /* Assigment of value for VERSION in the EMAFE_VERSION register */
#define EMAFE_VERSION_MFN_Pos                 _UINT32_(16)                                         /* (EMAFE_VERSION) Metal Fix Number Position */
#define EMAFE_VERSION_MFN_Msk                 (_UINT32_(0xF) << EMAFE_VERSION_MFN_Pos)             /* (EMAFE_VERSION) Metal Fix Number Mask */
#define EMAFE_VERSION_MFN(value)              (EMAFE_VERSION_MFN_Msk & (_UINT32_(value) << EMAFE_VERSION_MFN_Pos)) /* Assigment of value for MFN in the EMAFE_VERSION register */
#define EMAFE_VERSION_Msk                     _UINT32_(0x000FFFFF)                                 /* (EMAFE_VERSION) Register Mask  */


/* -------- EMAFE_RPR : (EMAFE Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define EMAFE_RPR_RXPTR_Pos                   _UINT32_(0)                                          /* (EMAFE_RPR) Receive Pointer Register Position */
#define EMAFE_RPR_RXPTR_Msk                   (_UINT32_(0xFFFFFFFF) << EMAFE_RPR_RXPTR_Pos)        /* (EMAFE_RPR) Receive Pointer Register Mask */
#define EMAFE_RPR_RXPTR(value)                (EMAFE_RPR_RXPTR_Msk & (_UINT32_(value) << EMAFE_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the EMAFE_RPR register */
#define EMAFE_RPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (EMAFE_RPR) Register Mask  */


/* -------- EMAFE_RCR : (EMAFE Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define EMAFE_RCR_RXCTR_Pos                   _UINT32_(0)                                          /* (EMAFE_RCR) Receive Counter Register Position */
#define EMAFE_RCR_RXCTR_Msk                   (_UINT32_(0xFFFF) << EMAFE_RCR_RXCTR_Pos)            /* (EMAFE_RCR) Receive Counter Register Mask */
#define EMAFE_RCR_RXCTR(value)                (EMAFE_RCR_RXCTR_Msk & (_UINT32_(value) << EMAFE_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the EMAFE_RCR register */
#define EMAFE_RCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (EMAFE_RCR) Register Mask  */


/* -------- EMAFE_RNPR : (EMAFE Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define EMAFE_RNPR_RXNPTR_Pos                 _UINT32_(0)                                          /* (EMAFE_RNPR) Receive Next Pointer Position */
#define EMAFE_RNPR_RXNPTR_Msk                 (_UINT32_(0xFFFFFFFF) << EMAFE_RNPR_RXNPTR_Pos)      /* (EMAFE_RNPR) Receive Next Pointer Mask */
#define EMAFE_RNPR_RXNPTR(value)              (EMAFE_RNPR_RXNPTR_Msk & (_UINT32_(value) << EMAFE_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the EMAFE_RNPR register */
#define EMAFE_RNPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (EMAFE_RNPR) Register Mask  */


/* -------- EMAFE_RNCR : (EMAFE Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define EMAFE_RNCR_RXNCTR_Pos                 _UINT32_(0)                                          /* (EMAFE_RNCR) Receive Next Counter Position */
#define EMAFE_RNCR_RXNCTR_Msk                 (_UINT32_(0xFFFF) << EMAFE_RNCR_RXNCTR_Pos)          /* (EMAFE_RNCR) Receive Next Counter Mask */
#define EMAFE_RNCR_RXNCTR(value)              (EMAFE_RNCR_RXNCTR_Msk & (_UINT32_(value) << EMAFE_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the EMAFE_RNCR register */
#define EMAFE_RNCR_Msk                        _UINT32_(0x0000FFFF)                                 /* (EMAFE_RNCR) Register Mask  */


