Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/emafe.h
/* -------- EMAFE_PTCR : (EMAFE Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define EMAFE_PTCR_RXTEN_Pos                  _UINT32_(0)                                          /* (EMAFE_PTCR) Receiver Transfer Enable Position */
#define EMAFE_PTCR_RXTEN_Msk                  (_UINT32_(0x1) << EMAFE_PTCR_RXTEN_Pos)              /* (EMAFE_PTCR) Receiver Transfer Enable Mask */
#define EMAFE_PTCR_RXTEN(value)               (EMAFE_PTCR_RXTEN_Msk & (_UINT32_(value) << EMAFE_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the EMAFE_PTCR register */
#define EMAFE_PTCR_RXTDIS_Pos                 _UINT32_(1)                                          /* (EMAFE_PTCR) Receiver Transfer Disable Position */
#define EMAFE_PTCR_RXTDIS_Msk                 (_UINT32_(0x1) << EMAFE_PTCR_RXTDIS_Pos)             /* (EMAFE_PTCR) Receiver Transfer Disable Mask */
#define EMAFE_PTCR_RXTDIS(value)              (EMAFE_PTCR_RXTDIS_Msk & (_UINT32_(value) << EMAFE_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the EMAFE_PTCR register */
#define EMAFE_PTCR_TXTEN_Pos                  _UINT32_(8)                                          /* (EMAFE_PTCR) Transmitter Transfer Enable Position */
#define EMAFE_PTCR_TXTEN_Msk                  (_UINT32_(0x1) << EMAFE_PTCR_TXTEN_Pos)              /* (EMAFE_PTCR) Transmitter Transfer Enable Mask */
#define EMAFE_PTCR_TXTEN(value)               (EMAFE_PTCR_TXTEN_Msk & (_UINT32_(value) << EMAFE_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the EMAFE_PTCR register */
#define EMAFE_PTCR_TXTDIS_Pos                 _UINT32_(9)                                          /* (EMAFE_PTCR) Transmitter Transfer Disable Position */
#define EMAFE_PTCR_TXTDIS_Msk                 (_UINT32_(0x1) << EMAFE_PTCR_TXTDIS_Pos)             /* (EMAFE_PTCR) Transmitter Transfer Disable Mask */
#define EMAFE_PTCR_TXTDIS(value)              (EMAFE_PTCR_TXTDIS_Msk & (_UINT32_(value) << EMAFE_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the EMAFE_PTCR register */
#define EMAFE_PTCR_RXCBEN_Pos                 _UINT32_(16)                                         /* (EMAFE_PTCR) Receiver Circular Buffer Enable Position */
#define EMAFE_PTCR_RXCBEN_Msk                 (_UINT32_(0x1) << EMAFE_PTCR_RXCBEN_Pos)             /* (EMAFE_PTCR) Receiver Circular Buffer Enable Mask */
#define EMAFE_PTCR_RXCBEN(value)              (EMAFE_PTCR_RXCBEN_Msk & (_UINT32_(value) << EMAFE_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the EMAFE_PTCR register */
#define EMAFE_PTCR_RXCBDIS_Pos                _UINT32_(17)                                         /* (EMAFE_PTCR) Receiver Circular Buffer Disable Position */
#define EMAFE_PTCR_RXCBDIS_Msk                (_UINT32_(0x1) << EMAFE_PTCR_RXCBDIS_Pos)            /* (EMAFE_PTCR) Receiver Circular Buffer Disable Mask */
#define EMAFE_PTCR_RXCBDIS(value)             (EMAFE_PTCR_RXCBDIS_Msk & (_UINT32_(value) << EMAFE_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the EMAFE_PTCR register */
#define EMAFE_PTCR_TXCBEN_Pos                 _UINT32_(18)                                         /* (EMAFE_PTCR) Transmitter Circular Buffer Enable Position */
#define EMAFE_PTCR_TXCBEN_Msk                 (_UINT32_(0x1) << EMAFE_PTCR_TXCBEN_Pos)             /* (EMAFE_PTCR) Transmitter Circular Buffer Enable Mask */
#define EMAFE_PTCR_TXCBEN(value)              (EMAFE_PTCR_TXCBEN_Msk & (_UINT32_(value) << EMAFE_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the EMAFE_PTCR register */
#define EMAFE_PTCR_TXCBDIS_Pos                _UINT32_(19)                                         /* (EMAFE_PTCR) Transmitter Circular Buffer Disable Position */
#define EMAFE_PTCR_TXCBDIS_Msk                (_UINT32_(0x1) << EMAFE_PTCR_TXCBDIS_Pos)            /* (EMAFE_PTCR) Transmitter Circular Buffer Disable Mask */
#define EMAFE_PTCR_TXCBDIS(value)             (EMAFE_PTCR_TXCBDIS_Msk & (_UINT32_(value) << EMAFE_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the EMAFE_PTCR register */
#define EMAFE_PTCR_ERRCLR_Pos                 _UINT32_(24)                                         /* (EMAFE_PTCR) Transfer Bus Error Clear Position */
#define EMAFE_PTCR_ERRCLR_Msk                 (_UINT32_(0x1) << EMAFE_PTCR_ERRCLR_Pos)             /* (EMAFE_PTCR) Transfer Bus Error Clear Mask */
#define EMAFE_PTCR_ERRCLR(value)              (EMAFE_PTCR_ERRCLR_Msk & (_UINT32_(value) << EMAFE_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the EMAFE_PTCR register */
#define EMAFE_PTCR_Msk                        _UINT32_(0x010F0303)                                 /* (EMAFE_PTCR) Register Mask  */


/* -------- EMAFE_PTSR : (EMAFE Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define EMAFE_PTSR_RXTEN_Pos                  _UINT32_(0)                                          /* (EMAFE_PTSR) Receiver Transfer Enable Position */
#define EMAFE_PTSR_RXTEN_Msk                  (_UINT32_(0x1) << EMAFE_PTSR_RXTEN_Pos)              /* (EMAFE_PTSR) Receiver Transfer Enable Mask */
#define EMAFE_PTSR_RXTEN(value)               (EMAFE_PTSR_RXTEN_Msk & (_UINT32_(value) << EMAFE_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the EMAFE_PTSR register */
#define EMAFE_PTSR_TXTEN_Pos                  _UINT32_(8)                                          /* (EMAFE_PTSR) Transmitter Transfer Enable Position */
#define EMAFE_PTSR_TXTEN_Msk                  (_UINT32_(0x1) << EMAFE_PTSR_TXTEN_Pos)              /* (EMAFE_PTSR) Transmitter Transfer Enable Mask */
#define EMAFE_PTSR_TXTEN(value)               (EMAFE_PTSR_TXTEN_Msk & (_UINT32_(value) << EMAFE_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the EMAFE_PTSR register */
#define EMAFE_PTSR_RXCBEN_Pos                 _UINT32_(16)                                         /* (EMAFE_PTSR) Receiver Circular Buffer Enable Position */
#define EMAFE_PTSR_RXCBEN_Msk                 (_UINT32_(0x1) << EMAFE_PTSR_RXCBEN_Pos)             /* (EMAFE_PTSR) Receiver Circular Buffer Enable Mask */
#define EMAFE_PTSR_RXCBEN(value)              (EMAFE_PTSR_RXCBEN_Msk & (_UINT32_(value) << EMAFE_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the EMAFE_PTSR register */
#define EMAFE_PTSR_TXCBEN_Pos                 _UINT32_(18)                                         /* (EMAFE_PTSR) Transmitter Circular Buffer Enable Position */
#define EMAFE_PTSR_TXCBEN_Msk                 (_UINT32_(0x1) << EMAFE_PTSR_TXCBEN_Pos)             /* (EMAFE_PTSR) Transmitter Circular Buffer Enable Mask */
#define EMAFE_PTSR_TXCBEN(value)              (EMAFE_PTSR_TXCBEN_Msk & (_UINT32_(value) << EMAFE_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the EMAFE_PTSR register */
#define EMAFE_PTSR_ERR_Pos                    _UINT32_(24)                                         /* (EMAFE_PTSR) Transfer Bus Error Position */
#define EMAFE_PTSR_ERR_Msk                    (_UINT32_(0x1) << EMAFE_PTSR_ERR_Pos)                /* (EMAFE_PTSR) Transfer Bus Error Mask */
#define EMAFE_PTSR_ERR(value)                 (EMAFE_PTSR_ERR_Msk & (_UINT32_(value) << EMAFE_PTSR_ERR_Pos)) /* Assigment of value for ERR in the EMAFE_PTSR register */
#define EMAFE_PTSR_Msk                        _UINT32_(0x01050101)                                 /* (EMAFE_PTSR) Register Mask  */


/* -------- EMAFE_PWPMR : (EMAFE Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define EMAFE_PWPMR_WPPTREN_Pos               _UINT32_(0)                                          /* (EMAFE_PWPMR) Write Protection Pointer Registers Enable Position */
#define EMAFE_PWPMR_WPPTREN_Msk               (_UINT32_(0x1) << EMAFE_PWPMR_WPPTREN_Pos)           /* (EMAFE_PWPMR) Write Protection Pointer Registers Enable Mask */
#define EMAFE_PWPMR_WPPTREN(value)            (EMAFE_PWPMR_WPPTREN_Msk & (_UINT32_(value) << EMAFE_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the EMAFE_PWPMR register */
#define EMAFE_PWPMR_WPCTREN_Pos               _UINT32_(1)                                          /* (EMAFE_PWPMR) Write Protection Counter Registers Enable Position */
#define EMAFE_PWPMR_WPCTREN_Msk               (_UINT32_(0x1) << EMAFE_PWPMR_WPCTREN_Pos)           /* (EMAFE_PWPMR) Write Protection Counter Registers Enable Mask */
#define EMAFE_PWPMR_WPCTREN(value)            (EMAFE_PWPMR_WPCTREN_Msk & (_UINT32_(value) << EMAFE_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the EMAFE_PWPMR register */
#define EMAFE_PWPMR_WPCREN_Pos                _UINT32_(2)                                          /* (EMAFE_PWPMR) Write Protection Control Register Enable Position */
#define EMAFE_PWPMR_WPCREN_Msk                (_UINT32_(0x1) << EMAFE_PWPMR_WPCREN_Pos)            /* (EMAFE_PWPMR) Write Protection Control Register Enable Mask */
#define EMAFE_PWPMR_WPCREN(value)             (EMAFE_PWPMR_WPCREN_Msk & (_UINT32_(value) << EMAFE_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the EMAFE_PWPMR register */
#define EMAFE_PWPMR_WPKEY_Pos                 _UINT32_(8)                                          /* (EMAFE_PWPMR) Write Protection Key Position */
#define EMAFE_PWPMR_WPKEY_Msk                 (_UINT32_(0xFFFFFF) << EMAFE_PWPMR_WPKEY_Pos)        /* (EMAFE_PWPMR) Write Protection Key Mask */
#define EMAFE_PWPMR_WPKEY(value)              (EMAFE_PWPMR_WPKEY_Msk & (_UINT32_(value) << EMAFE_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the EMAFE_PWPMR register */
#define   EMAFE_PWPMR_WPKEY_PASSWD_Val        _UINT32_(0x504443)                                   /* (EMAFE_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define EMAFE_PWPMR_WPKEY_PASSWD              (EMAFE_PWPMR_WPKEY_PASSWD_Val << EMAFE_PWPMR_WPKEY_Pos) /* (EMAFE_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define EMAFE_PWPMR_Msk                       _UINT32_(0xFFFFFF07)                                 /* (EMAFE_PWPMR) Register Mask  */


/** \brief EMAFE register offsets definitions */
#define EMAFE_CR_REG_OFST              _UINT32_(0x00)      /* (EMAFE_CR) Control Register Offset */
#define EMAFE_MR_REG_OFST              _UINT32_(0x04)      /* (EMAFE_MR) Mode Register Offset */
#define EMAFE_CDCR_REG_OFST            _UINT32_(0x08)      /* (EMAFE_CDCR) Channels Difference Comparison Register Offset */
#define EMAFE_EMR_REG_OFST             _UINT32_(0x0C)      /* (EMAFE_EMR) Extended Mode Register Offset */
#define EMAFE_DMA_DATA_REG_OFST        _UINT32_(0x10)      /* (EMAFE_DMA_DATA) DMA Data Register Offset */
#define EMAFE_DATA_REG_OFST            _UINT32_(0x14)      /* (EMAFE_DATA) Data Channel 0 Register Offset */
#define EMAFE_DATA0_REG_OFST           _UINT32_(0x14)      /* (EMAFE_DATA0) Data Channel 0 Register Offset */
#define EMAFE_DATA1_REG_OFST           _UINT32_(0x18)      /* (EMAFE_DATA1) Data Channel 0 Register Offset */
#define EMAFE_DATA2_REG_OFST           _UINT32_(0x1C)      /* (EMAFE_DATA2) Data Channel 0 Register Offset */
#define EMAFE_DATA3_REG_OFST           _UINT32_(0x20)      /* (EMAFE_DATA3) Data Channel 0 Register Offset */
#define EMAFE_DATA4_REG_OFST           _UINT32_(0x24)      /* (EMAFE_DATA4) Data Channel 0 Register Offset */
#define EMAFE_CHA_CFG1_REG_OFST        _UINT32_(0x40)      /* (EMAFE_CHA_CFG1) Channel A Comparison Configuration 1 Offset */
#define EMAFE_CHB_CFG1_REG_OFST        _UINT32_(0x44)      /* (EMAFE_CHB_CFG1) Channel B Comparison Configuration 1 Offset */
#define EMAFE_CHA_CFG2_REG_OFST        _UINT32_(0x48)      /* (EMAFE_CHA_CFG2) Channel A Comparison Configuration 2 Offset */
#define EMAFE_CHB_CFG2_REG_OFST        _UINT32_(0x4C)      /* (EMAFE_CHB_CFG2) Channel B Comparison Configuration 2 Offset */
#define EMAFE_IER_REG_OFST             _UINT32_(0x50)      /* (EMAFE_IER) Interrupt Enable Register Offset */
#define EMAFE_IDR_REG_OFST             _UINT32_(0x54)      /* (EMAFE_IDR) Interrupt Disable Register Offset */
#define EMAFE_IMR_REG_OFST             _UINT32_(0x58)      /* (EMAFE_IMR) Interrupt Mask Register Offset */
#define EMAFE_ISR_REG_OFST             _UINT32_(0x5C)      /* (EMAFE_ISR) Interrupt Status Register Offset */
#define EMAFE_SR_REG_OFST              _UINT32_(0x60)      /* (EMAFE_SR) Status Register Offset */
#define EMAFE_WPMR_REG_OFST            _UINT32_(0xE4)      /* (EMAFE_WPMR) Write Protection Mode Register Offset */
#define EMAFE_WPSR_REG_OFST            _UINT32_(0xE8)      /* (EMAFE_WPSR) Write Protection Status Register Offset */
#define EMAFE_VERSION_REG_OFST         _UINT32_(0xFC)      /* (EMAFE_VERSION) Version Register Offset */
#define EMAFE_RPR_REG_OFST             _UINT32_(0x100)     /* (EMAFE_RPR) Receive Pointer Register Offset */
#define EMAFE_RCR_REG_OFST             _UINT32_(0x104)     /* (EMAFE_RCR) Receive Counter Register Offset */
#define EMAFE_RNPR_REG_OFST            _UINT32_(0x110)     /* (EMAFE_RNPR) Receive Next Pointer Register Offset */
#define EMAFE_RNCR_REG_OFST            _UINT32_(0x114)     /* (EMAFE_RNCR) Receive Next Counter Register Offset */
#define EMAFE_PTCR_REG_OFST            _UINT32_(0x120)     /* (EMAFE_PTCR) Transfer Control Register Offset */
#define EMAFE_PTSR_REG_OFST            _UINT32_(0x124)     /* (EMAFE_PTSR) Transfer Status Register Offset */
#define EMAFE_PWPMR_REG_OFST           _UINT32_(0x128)     /* (EMAFE_PWPMR) Write Protection Mode Register Offset */

